dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_sensing.c
/***************************************************************************//**
* \file cy_capsense_sensing.c
* \version 1.1
*
* \brief
* This file contains the source of functions common for different sensing
* methods.
*
********************************************************************************
* \copyright
* Copyright 2018, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include <stdlib.h>
#include "cy_gpio.h"
#include "cy_sysclk.h"
#include "cy_csd.h"

#include "cy_capsense_common.h"
#include "cy_capsense_structure.h"
#include "cy_capsense_sensing.h"
#include "cy_capsense_csx.h"
#include "cy_capsense_csd.h"
#include "cy_capsense_lib.h"


/*******************************************************************************
* Constants
*******************************************************************************/
#define CY_CAPSENSE_AUTOTUNE_CALIBRATION_RESOLUTION         (12u)
#define CY_CAPSENSE_AUTOTUNE_CALIBRATION_FREQ_KHZ           (1500u)
#define CY_CAPSENSE_CSD_SNS_FREQ_KHZ_MAX                    (6000u)
#define CY_CAPSENSE_CSD_AUTOTUNE_CAL_UNITS                  (1000u)
#define CY_CAPSENSE_AUTOTUNE_CP_MAX                         (69000Lu)

#define CY_CAPSENSE_EXT_CAP_DISCHARGE_TIME                  (1u)

#define CY_CAPSENSE_VREF_GAIN_MAX       (32u)
#define CY_CAPSENSE_VREF_VDDA_MIN_DIFF  (600u)
#define CY_CAPSENSE_VREF_SRSS_MV        (800u)
#define CY_CAPSENSE_VREF_PASS_MV        (1200u)



const cy_stc_csd_config_t cy_capsense_csdCfg = CY_CAPSENSE_CSD_CONFIG_DEFAULT;


/*******************************************************************************
* Function Name: Cy_CapSense_IsBusy
****************************************************************************//**
*
* Returns the current status of the middleware (Scan is completed or Scan is in
* progress).
*
* This function returns a status of the CapSense middleware whether a scan is
* currently in progress or not. If the middleware is busy, no new scan or setup
* widgets is made. The critical section (i.e. disable global interrupt)
* is recommended for the application when the device transitions from
* the Active mode to Sleep or Deep Sleep modes.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the current status of the middleware:
* - CY_CAPSENSE_NOT_BUSY - No scan is in progress and a next scan
* can be initiated.
* - CY_CAPSENSE_SW_STS_BUSY - The previous scanning is not completed
* and the hardware block is busy.
*
*******************************************************************************/
uint32_t Cy_CapSense_IsBusy(const cy_stc_capsense_context_t * context)
{
    return (context->ptrCommonContext->status & CY_CAPSENSE_SW_STS_BUSY);
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetBusyFlags
****************************************************************************//**
*
* Sets BUSY flags of the cy_capsense_context.status register specified
* by the flags parameter.
*
* \details
* This is an internal function. Do not call this function directly from 
* the application layer.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetBusyFlags(cy_stc_capsense_context_t * context)
{
    context->ptrCommonContext->status |= CY_CAPSENSE_SW_STS_BUSY;
}


/*******************************************************************************
* Function Name: Cy_CapSense_ClrBusyFlags
****************************************************************************//**
*
* Clears BUSY flags of the cy_capsense_context.status register specified
* by the flags parameter.
*
* This is an internal function. Do not call this function directly from 
* the application layer.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_ClrBusyFlags(cy_stc_capsense_context_t * context)
{
    /* Clear busy flag */
    context->ptrCommonContext->status &= (uint32_t)(~((uint32_t)CY_CAPSENSE_SW_STS_BUSY));
    
    /* Reset scan flags */
    context->ptrActiveScanSns->scanScopeAll = CY_CAPSENSE_SCAN_SCOPE_SGL_WD;
    context->ptrActiveScanSns->scanScopeSns = CY_CAPSENSE_SCAN_SCOPE_UND;
    
    /* Mark completion of scan cycle */ 
    context->ptrCommonContext->scanCounter++;
    
     if(NULL != context->ptrCommonContext->ptrEOSCallback)
    {
        context->ptrCommonContext->ptrEOSCallback(context->ptrActiveScanSns);
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetupWidget
****************************************************************************//**
*
* Performs the initialization required to scan the specified widget.
*
* This function prepares the middleware to scan all the sensors in the specified
* widget by executing the following tasks:
* 1. Re-initialize the hardware if it is not configured to perform the
* sensing method used by the specified widget, this happens only if the
* CSD and CSX methods are used in the middleware.
* 2. Initialize the hardware with specific sensing configuration (e.g.
* sensor clock, scan resolution) used by the widget.
* 3. Disconnect all previously connected electrodes, if the electrodes
* connected by the Cy_CapSense_CSDSetupWidgetExt(),
* Cy_CapSense_CSXSetupWidgetExt() or Cy_CapSense_CSDConnectSns()
* functions and not disconnected.
*
* This function does not start sensor scanning. The Cy_CapSense_Scan()
* function must be called to start the scan sensors in the widget. If this
* function is called more than once, it does not break the middleware operation,
* but only the last initialized widget is in effect.
*
* \param widgetId
* Specifies the ID number of the widget to be initialized for scanning.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the widget setting up operation:
* - CY_RET_SUCCESS - The operation is successfully completed.
* - CY_RET_BAD_PARAM - The widget is invalid or if the specified widget is
* disabled.
* - CY_RET_INVALID_STATE - The previous scanning is not completed and the
* hardware block is busy.
* - CY_RET_UNKNOWN - An unknown sensing method is used by the widget or any
* other spurious error occurred.
*
**********************************************************************************/
cy_status Cy_CapSense_SetupWidget(
                uint32_t widgetId, 
                cy_stc_capsense_context_t * context)
{
    cy_status widgetStatus;

    if (CY_CAPSENSE_SW_STS_BUSY == Cy_CapSense_IsBusy(context))
    {
        /* Previous widget is being scanned. Return error. */
        widgetStatus = CY_RET_INVALID_STATE;
    }
    /*
     * Check whether widget id is valid, specified widget is enabled and widget did not
     * detect any fault conditions. If all conditions are met,
     * set widgetStatus as good, if not, set widgetStatus as bad.
     */
    else if ((context->ptrCommonConfig->numWd > widgetId) &&
        (0u == (context->ptrWdConfig[widgetId].ptrWdContext->status & CY_CAPSENSE_WD_DISABLE_MASK)))
    {
        /* Check widget sensing method and call corresponding setup function */
        switch(context->ptrWdConfig[widgetId].senseMethod)
        {
            case (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSD_E:
                Cy_CapSense_CSDSetupWidget(widgetId, context);
                break;

            case (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSX_E:
                Cy_CapSense_CSXSetupWidget(widgetId, context);
                break;

            default:
                widgetStatus = CY_RET_UNKNOWN;
                break;
        }
        widgetStatus = CY_RET_SUCCESS;
    }
    else
    {
        widgetStatus = CY_RET_BAD_PARAM;
    }

