dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_sensing.c
        /* IDACs Polarities */
        if (CY_CAPSENSE_IDAC_SINKING == context->ptrCommonConfig->csdChargeTransfer)
        {
            context->ptrInternalContext->csdIdacAConfig |= (CY_CAPSENSE_CSD_IDACA_POLARITY_VDDA_SNK << CY_CAPSENSE_CSD_IDACA_POLARITY_POS);
            context->ptrInternalContext->csdIdacBConfig |= (CY_CAPSENSE_CSD_IDACB_POLARITY_VDDA_SNK << CY_CAPSENSE_CSD_IDACB_POLARITY_POS);
        }
        else
        {
            context->ptrInternalContext->csdIdacAConfig |= (CY_CAPSENSE_CSD_IDACA_POLARITY_VSSA_SRC << CY_CAPSENSE_CSD_IDACA_POLARITY_POS);
            context->ptrInternalContext->csdIdacBConfig |= (CY_CAPSENSE_CSD_IDACB_POLARITY_VSSA_SRC << CY_CAPSENSE_CSD_IDACB_POLARITY_POS);
        }
        /* IDACs Balancing Mode */
        context->ptrInternalContext->csdIdacAConfig |= (CY_CAPSENSE_CSD_IDACA_BALL_MODE_FULL << CY_CAPSENSE_CSD_IDACA_BALL_MODE_POS);
        context->ptrInternalContext->csdIdacBConfig |= (CY_CAPSENSE_CSD_IDACB_BALL_MODE_FULL << CY_CAPSENSE_CSD_IDACB_BALL_MODE_POS);
        /* Legs Config */
        context->ptrInternalContext->csdIdacAConfig |= (CY_CAPSENSE_CSD_IDACA_LEG1_MODE_CSD << CY_CAPSENSE_CSD_IDACA_LEG1_MODE_POS);
        context->ptrInternalContext->csdIdacAConfig |= (CY_CAPSENSE_CSD_IDACA_LEG2_MODE_CSD << CY_CAPSENSE_CSD_IDACA_LEG2_MODE_POS);
        context->ptrInternalContext->csdIdacAConfig |= (CY_CAPSENSE_CSD_IDACA_LEG1_EN_MSK);
        
        context->ptrInternalContext->csdIdacBConfig |= (CY_CAPSENSE_CSD_IDACB_LEG1_MODE_CSD_STATIC << CY_CAPSENSE_CSD_IDACB_LEG1_MODE_POS);
        context->ptrInternalContext->csdIdacBConfig |= (CY_CAPSENSE_CSD_IDACB_LEG2_MODE_CSD_STATIC << CY_CAPSENSE_CSD_IDACB_LEG2_MODE_POS);
        if (0u != context->ptrCommonConfig->csdIdacCompEn)
        {
            context->ptrInternalContext->csdIdacBConfig |= (CY_CAPSENSE_CSD_IDACB_LEG1_EN_MSK);
        }

        /* Switch Csh tank selection */
        context->ptrInternalContext->csdRegSwFwTankSelScan = 0u;
        context->ptrInternalContext->csdRegSwFwTankSelInit = 0u;
        if ((0u != context->ptrCommonConfig->csdShieldEn) &&
            (0u != context->ptrCommonConfig->csdCTankShieldEn) &&
            ((uint8_t)CY_CAPSENSE_CTANKPAD_E == context->ptrInternalContext->csdCshConnection))
        {
            context->ptrInternalContext->csdRegSwFwTankSelScan = (CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_F2PT_STATIC_CLOSE |
                                                                  CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_F2CB_STATIC_CLOSE);
        }

        if (((uint8_t)CY_CAPSENSE_CTANKPAD_E == context->ptrInternalContext->csdCmodConnection) || 
            ((uint8_t)CY_CAPSENSE_CTANKPAD_E == context->ptrInternalContext->csdCshConnection))
        {
            context->ptrInternalContext->csdRegSwFwTankSelInit = (CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_F2PT_STATIC_CLOSE | 
                                                                  CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_F2MA_STATIC_CLOSE |
                                                                  CY_CAPSENSE_CSD_SW_FW_TANK_SEL_SW_F2CA_STATIC_CLOSE);
        }

        /* IO Control Selection */
        if (CY_CAPSENSE_IDAC_SINKING == context->ptrCommonConfig->csdChargeTransfer)
        {
            if (0u != context->ptrCommonConfig->csdShieldEn)
            {
                context->ptrInternalContext->csdRegIoSel = (CY_CAPSENSE_CSD_TX_N_OUT_EN_PHI1 | 
                                                            CY_CAPSENSE_CSD_TX_N_AMUXA_EN_PHI2 |
                                                            CY_CAPSENSE_CSD_TX_OUT_EN_PHI1_DELAY | 
                                                            CY_CAPSENSE_CSD_TX_AMUXB_EN_PHI2_DELAY |
                                                            CY_CAPSENSE_CSD_TX_OUT_MSK | 
                                                            CY_CAPSENSE_CSD_TX_N_OUT_STATIC_CLOSE);
            }
            else
            {
                context->ptrInternalContext->csdRegIoSel = (CY_CAPSENSE_CSD_TX_N_OUT_EN_PHI1 | 
                                                            CY_CAPSENSE_CSD_TX_N_AMUXA_EN_PHI2 |
                                                            CY_CAPSENSE_CSD_TX_N_OUT_STATIC_CLOSE);
            }
        }
        else
        {
            if (0u != context->ptrCommonConfig->csdShieldEn)
            {
                context->ptrInternalContext->csdRegIoSel = (CY_CAPSENSE_CSD_TX_N_OUT_EN_PHI1 | 
                                                            CY_CAPSENSE_CSD_TX_N_AMUXA_EN_PHI2 |
                                                            CY_CAPSENSE_CSD_TX_OUT_EN_PHI1_DELAY | 
                                                            CY_CAPSENSE_CSD_TX_AMUXB_EN_PHI2_DELAY);
            }
            else
            {
                context->ptrInternalContext->csdRegIoSel = (CY_CAPSENSE_CSD_TX_N_OUT_EN_PHI1 | 
                                                            CY_CAPSENSE_CSD_TX_N_AMUXA_EN_PHI2);
            }
        }

        if(context->ptrCommonConfig->csdVref == 0u)
        {
            /*
            * Get the recommended Vref voltage value if the Custom Vref option is not used.
            */
            temp = Cy_CapSense_GetVrefAutoMv((uint32_t)context->ptrCommonConfig->vdda);
        }
        else
        {
            /*
            * Initialize the Temp variable with the user defined Vref voltage if the
            * Custom Vref option is used.
            */
            temp = context->ptrCommonConfig->csdVref;
        }

        if(CY_CAPSENSE_VREF_SRSS == context->ptrCommonConfig->ssVrefSource)
        {
            /*
            * Calculate the VrefHigh Gain for the desired Vref voltage when SRSS is used as the Vref source. 
            */
            temp = (uint8_t)Cy_CapSense_GetVrefHighGain((uint32_t)context->ptrCommonConfig->vdda,
                                                                                CY_CAPSENSE_VREF_SRSS_MV, temp);
            /*
            * Calculates the VrefHigh voltage, when SRSS is used as the Vref source.
            */
            context->ptrInternalContext->csdVrefVoltageMv = (uint16_t)Cy_CapSense_GetVrefHighMv(CY_CAPSENSE_VREF_SRSS_MV, temp);
        }
        else if(CY_CAPSENSE_VREF_PASS == context->ptrCommonConfig->ssVrefSource)
        {
            /*
            * Calculate the VrefHigh Gain for the desired Vref voltage when PASS is used as the Vref source. 
            */
            temp = (uint8_t)Cy_CapSense_GetVrefHighGain((uint32_t)context->ptrCommonConfig->vdda,
                                                                                CY_CAPSENSE_VREF_PASS_MV, temp);
            /*
            * Calculates the VrefHigh voltage, when SRSS is used as the Vref source.
            */
            context->ptrInternalContext->csdVrefVoltageMv = (uint16_t)Cy_CapSense_GetVrefHighMv(CY_CAPSENSE_VREF_PASS_MV, temp);
        }
        else
        {
            /*
            * Pass the Vref source voltage to the VrefHigh output in case if the Vref source in unknown. 
            */
            temp = (uint8_t)(CY_CAPSENSE_VREF_GAIN_MAX - 1u);
        }

        context->ptrInternalContext->csdVrefGain = (uint8_t)temp;
        context->ptrInternalContext->csdRegRefgen  = (CSD_REFGEN_REFGEN_EN_Msk |
                                                      CSD_REFGEN_RES_EN_Msk |
                                                      (temp << CSD_REFGEN_GAIN_Pos));
    }    

    /* Common initialization */
    
