dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_sensing.c
    /*
     * CSD HW block is initialized in the Setup Widget functions based
     * on widget sensing method. 
     */
    Cy_CapSense_SwitchSensingMode((uint8_t)CY_CAPSENSE_UNDEFINED_E, context);

    return (initStatus);
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetPinState
****************************************************************************//**
*
* Sets the state (drive mode and HSIOM state) of the electrode used by a sensor.
* The possible states are GND, Shield, High-Z, Tx, Rx, and Sensor. If the 
* electrode specified in the input parameter is a ganged one, then the state 
* of all pins associated with the ganged electrode is updated.
*
* This function sets a specified state for a specified sensor electrode. For the
* CSD of button or slider type widgets, the sensor electrode is a sensor ID.
* For the CSD matrix button or touchpad type widgets, the sensor electrode is row or
* column ID. For the CSX widgets, it is either an Rx or Tx electrode ID. 
* If the specified electrode is a ganged one, then the specified state is set 
* to which all the pins belong.
* This function must not be called while the middleware is in the busy state.
*
* This function accepts the CY_CAPSENSE_SHIELD and
* CY_CAPSENSE_SENSOR states as an input only if there is at least
* one CSD widget configured. Similarly, this function accepts the 
* CY_CAPSENSE_TX_PIN and CY_CAPSENSE_RX_PIN states as an input only 
* if there is at least one CSX widget in the project.
*
* Calling this function directly from the application layer is not
* recommended. This function is used to implement only the custom-specific
* use cases. Functions that perform a setup and scan of a sensor/widget
* automatically set the required pin states. They ignore changes
* in the design made by the Cy_CapSense_SetPinState() function.
* This function checks widgetId and sensorElement for correctness.
*
* \param widgetId
* Specifies the ID of the widget to change the pin state of the specified
* sensor.
*
* \param sensorElement
* Specifies the ID of the sensor element within the widget to change
* its pin state.
* For the CSD widgets, sensorElement is the sensor ID.
* For the CSX widgets, sensorElement is defined either as Rx ID or Tx ID.
* The first Rx in a widget corresponds to sensorElement = 0; the second
* Rx in a widget corresponds to sensorElement = 1, and so on.
* The last Tx in a widget corresponds to sensorElement = (RxNum + TxNum - 1).
*
* \param state
* Specifies the state of the sensor to be set:
* 1. CY_CAPSENSE_GROUND - The pin is connected to the ground.
* 2. CY_CAPSENSE_HIGHZ - The drive mode of the pin is set to High-Z
* Analog.
* 3. CY_CAPSENSE_SHIELD - The shield signal is routed to the pin
* (available only if CSD sensing method with shield electrode is enabled).
* 4. CY_CAPSENSE_SENSOR - The pin is connected to the scanning bus
* (available only if CSD sensing method is enabled).
* 5. CY_CAPSENSE_TX_PIN - The Tx signal is routed to the sensor
* (available only if CSX sensing method is enabled).
* 6. CY_CAPSENSE_RX_PIN - The pin is connected to the scanning bus
* (available only if CSX sensing method is enabled).
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return status
* Returns the operation status:
* - CY_RET_SUCCESS - Indicates the successful electrode setting.
* - CY_RET_BAD_PARAM - 1) widgetID or sensorElement are not valid;
* 2) the CSD sensing method is disabled for desired 
* CY_CAPSENSE_SHIELD or CY_CAPSENSE_SENSOR states;
* 3) the CSX sensing method is disabled for desired 
* CY_CAPSENSE_TX_PIN or CY_CAPSENSE_RX_PIN states.
*
*******************************************************************************/
cy_status Cy_CapSense_SetPinState(
                uint32_t widgetId, 
                uint32_t sensorElement, 
                uint32_t state, 
                cy_stc_capsense_context_t * context)
{
    cy_status connState = CY_RET_BAD_PARAM;
    uint32_t eltdNum;
    uint32_t eltdIndex;
    uint32_t interruptState;
    cy_stc_capsense_pin_config_t const * ioPtr;
    cy_stc_capsense_widget_config_t const * ptrWdCfg = &context->ptrWdConfig[widgetId];
    
    if (context->ptrCommonConfig->numWd > widgetId)
    {
        /* Get number of electrodes within the widget */
        eltdNum = (uint32_t)ptrWdCfg->numCols + ptrWdCfg->numRows;
        if (((uint8_t)CY_CAPSENSE_CSD_SENSING_METHOD == (uint32_t)ptrWdCfg->senseMethod) &&
           (((uint8_t)CY_CAPSENSE_WD_BUTTON_E == ptrWdCfg->wdType) || 
            ((uint8_t)CY_CAPSENSE_WD_LINEAR_SLIDER_E == ptrWdCfg->wdType) ||
            ((uint8_t)CY_CAPSENSE_WD_RADIAL_SLIDER_E == ptrWdCfg->wdType)))
        {
            eltdNum = context->ptrWdConfig->numSns;
        }
        
        if (eltdNum > sensorElement)
        {
            /* Get number of electrode's pins and a pointer to the electrode's pin structure */
            eltdNum = ptrWdCfg->ptrEltdConfig->numPins;
            ioPtr = ptrWdCfg->ptrEltdConfig->ptrPin;
            /* Loop through all pins of the specified sensor electrode */
            for (eltdIndex = 0u; eltdIndex < eltdNum; eltdIndex++)
            {
                /* Reset HSIOM and PC registers */
                interruptState = Cy_SysLib_EnterCriticalSection();
                Cy_GPIO_SetHSIOM(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber, CY_CAPSENSE_HSIOM_SEL_GPIO);
                Cy_SysLib_ExitCriticalSection(interruptState);

                switch (state)
                {
                    case CY_CAPSENSE_GROUND:
                        interruptState = Cy_SysLib_EnterCriticalSection();
                        Cy_GPIO_SetDrivemode(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber, CY_GPIO_DM_STRONG_IN_OFF);
                        Cy_GPIO_Clr(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber);
                        Cy_SysLib_ExitCriticalSection(interruptState);
                        
                        connState = CY_RET_SUCCESS;
                        break;

