dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_sensing.c
                    case CY_CAPSENSE_HIGHZ:
                        interruptState = Cy_SysLib_EnterCriticalSection();
                        Cy_GPIO_SetDrivemode(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber, CY_GPIO_DM_ANALOG);
                        Cy_GPIO_Clr(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber);
                        Cy_SysLib_ExitCriticalSection(interruptState);
                        
                        connState = CY_RET_SUCCESS;
                        break;

                    case CY_CAPSENSE_SENSOR:
                        if (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csdEn)
                        {
                            /* Enable sensor */
                            Cy_CapSense_CSDConnectSns(ioPtr, context);
                            
                            connState = CY_RET_SUCCESS;
                        }
                        break;

                    case CY_CAPSENSE_SHIELD:
                        if (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csdShieldEn)
                        {
                            Cy_CapSense_SsConfigPinRegisters(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber, 
                                                             CY_GPIO_DM_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD);
                            connState = CY_RET_SUCCESS;
                        }
                        break;

                    case CY_CAPSENSE_TX_PIN:
                            
                        if (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csxEn)
                        {
                            Cy_CapSense_SsConfigPinRegisters(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber, 
                                                             CY_GPIO_DM_STRONG_IN_OFF, CY_CAPSENSE_HSIOM_SEL_CSD_SHIELD);
                            connState = CY_RET_SUCCESS;
                        }
                        break;

                    case CY_CAPSENSE_RX_PIN:
                        if (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csxEn)
                        {
                            Cy_CapSense_SsConfigPinRegisters(ioPtr->pcPtr, (uint32_t)ioPtr->pinNumber, 
                                                             CY_GPIO_DM_ANALOG, CY_CAPSENSE_HSIOM_SEL_AMUXA);
                            connState = CY_RET_SUCCESS;
                        }
                        break;

                    default:
                        break;
                }

                ioPtr++;
            }
        }
    }
    return (connState);
}


/*******************************************************************************
* Function Name: Cy_CapSense_SwitchSensingMode
****************************************************************************//**
*
* This function changes the mode for case when both CSD and CSX widgets are
* scanned.
*
* Once the function is called it performs the following tasks:
* 1. Releasing HW block by existing sensing mode.
* 2. Configuring corresponding external capacitors and sensor pins into
*    default states.
* 3. Setting new mode.
* 4. Configuring HW to the new sensing mode.
*
* \param mode
* Specifies the scan mode:
* - CY_CAPSENSE_SENSE_METHOD_CSD_E
* - CY_CAPSENSE_SENSE_METHOD_CSX_E
* - CY_CAPSENSE_UNDEFINED_E
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SwitchSensingMode(uint8_t mode, cy_stc_capsense_context_t * context)
{
    if (context->ptrActiveScanSns->currentSenseMethod != mode)
    {
        /* The requested mode differs from the current one. Disable the current mode. */
        switch(context->ptrActiveScanSns->currentSenseMethod)
        {
            case (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSD_E:
                Cy_CapSense_CSDDisableMode(context);
                break;
            case (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSX_E:
                Cy_CapSense_CSXDisableMode(context);
                break;
            default:
                break;
        }

        context->ptrActiveScanSns->currentSenseMethod = mode;
        
        /* Enable the specified mode */
        switch(context->ptrActiveScanSns->currentSenseMethod)
        {
            case (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSD_E:
                Cy_CapSense_CSDInitialize(context);
                break;
            case (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSX_E:
                Cy_CapSense_CSXInitialize(context);
                break;
            default:
                break;
        }
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetIOsInDefaultState
****************************************************************************//**
*
* Sets all CapSense pins into a default state.
*
* \details
* Sets all the CSD/CSX IOs into a default state:
* - HSIOM   - Disconnected, the GPIO mode.
* - DM      - Strong drive.
* - State   - Zero.
*
* Do not call this function directly from the application
* layer.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetIOsInDefaultState(const cy_stc_capsense_context_t * context)
{
    uint32_t loopIndex;
    uint32_t interruptState;
    const cy_stc_capsense_pin_config_t * ptrPinCfg = context->ptrPinConfig;

    /* Loop through all electrodes */
    for (loopIndex = 0u; loopIndex < context->ptrCommonConfig->numPin; loopIndex++)
    {
        interruptState = Cy_SysLib_EnterCriticalSection();
        Cy_GPIO_Pin_FastInit(ptrPinCfg->pcPtr, (uint32_t)ptrPinCfg->pinNumber, 
                CY_GPIO_DM_STRONG, 0u, CY_CAPSENSE_HSIOM_SEL_GPIO);
        Cy_SysLib_ExitCriticalSection(interruptState);

        /* Get next electrode */
        ptrPinCfg++;
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_SetSpecificIOsInDefaultState
****************************************************************************//**
*
* Sets all CapSense pins into a default state.
*
* \details
* Sets all external capacitors and shield electrodes into a default state:
* - HSIOM   - Disconnected, the GPIO mode.
* - DM      - High-Z Analog.
*
* Do not call this function directly from the application
* layer.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SetSpecificIOsInDefaultState(const cy_stc_capsense_context_t * context)
{
    if (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csdEn)
    {
        /* Cmod pin to default state */
        Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCmod, (uint32_t)context->ptrCommonConfig->pinCmod, CY_GPIO_DM_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO);

        if (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csdShieldEn)
        {
            /* Disconnect shields */
            Cy_CapSense_CSDDisableShieldElectrodes(context);
            
