dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_sensing.c
            if (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csdCTankShieldEn)
            {
                /* Csh pin to default state */
                Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCsh, (uint32_t)context->ptrCommonConfig->pinCsh, CY_GPIO_DM_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO);
            }
        }
    }

    if (CY_CAPSENSE_ENABLE == context->ptrCommonConfig->csxEn)
    {
        /* CintA pin to default state */
        Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCintA, (uint32_t)context->ptrCommonConfig->pinCintA, CY_GPIO_DM_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO);

        /* CintB pin to default state */
        Cy_CapSense_SsConfigPinRegisters(context->ptrCommonConfig->portCintB, (uint32_t)context->ptrCommonConfig->pinCintB, CY_GPIO_DM_ANALOG, CY_CAPSENSE_HSIOM_SEL_GPIO);
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_SsPostAllWidgetsScan
****************************************************************************//**
*
* Configures and triggers the scan of the next widget if queue is not empty.
* This function should not be used by the application layer.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_SsPostAllWidgetsScan(cy_stc_capsense_context_t * context)
{
    /*
    * 1. Increment widget index
    * 2. Check whether all the widgets are scanned
    * 3. If all the widgets are not scanned, set up and scan next widget
    */
    cy_status postScanStatus;
    cy_stc_active_scan_sns_t * ptrActive = context->ptrActiveScanSns;
    uint32_t widgetId = (uint32_t)ptrActive->widgetIndex + 1u;
    
    do
    {
        if (context->ptrCommonConfig->numWd > widgetId)
        {
            /* Set up the next widget */
            context->ptrCommonContext->status = 0u;
            postScanStatus = Cy_CapSense_SetupWidget(widgetId, context);
            if (CY_RET_SUCCESS == postScanStatus)
            {
                (void)Cy_CapSense_Scan(context);
            }
            else
            {
                /* The next widget is not available for scanning. Skip it. */
                widgetId++;
            }
        }
        else
        {
            /* All the widgets are scanned. Reset BUSY flag. */
            Cy_CapSense_ClrBusyFlags(context);

            /* Set postScanStatus to exit the while loop */
            postScanStatus = CY_RET_SUCCESS;
        }
    } while (CY_RET_SUCCESS != postScanStatus);
}


/*******************************************************************************
* Function Name: Cy_CapSense_InterruptHandler
****************************************************************************//**
*
* Implements all CapSense actions needed to be executed inside CSD ISR.
* 
* This function must be called inside the user-defined interrupt service
* routine.
*
* The CapSense component uses an interrupt that triggers after the end 
* of each sensor scan. After scanning is complete, the ISR copies the 
* measured sensor raw data to the \ref group_capsense_structures. 
* If the scanning queue is not empty, the ISR starts the next sensor 
* scanning.
* 
* The CapSense implementation avoids using critical sections in the code. 
* In an unavoidable situation, the critical section is used and the code 
* is optimized for the shortest execution time.
*
* The CapSense component does not alter or affect the priority of other 
* interrupts in the system.
* 
* \param base
* The pointer to the base register address of CSD HW block.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
*******************************************************************************/
void Cy_CapSense_InterruptHandler(const CSD_Type * base, cy_stc_capsense_context_t * context)
{
    (void)base;
    context->ptrActiveScanSns->ptrISRCallback((void *)context);
}


/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateWidget
****************************************************************************//**
*
* Calibrates the IDACs for all the sensors in the specified widget to the 
* default target.
*
* This function detects the sensing method used by the widget prior 
* to calibration.
* This function performs exactly the same tasks as
* Cy_CapSense_CalibrateAllWidgets(), but only for a specified widget.
*
* \param widgetId
* Specifies the ID number of the widget to calibrate its IDACs.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the specified widget calibration:
* - CY_RET_SUCCESS - The operation is successfully completed.
* - CY_RET_BAD_PARAM - The input parameter is invalid.
* - CY_RET_BAD_DATA - The calibration failed and the middleware may not
* operate as expected.
*
*******************************************************************************/
cy_status Cy_CapSense_CalibrateWidget(uint32_t widgetId, cy_stc_capsense_context_t * context)
{
    cy_status calibrateStatus = CY_RET_BAD_PARAM;

    if(context->ptrCommonConfig->numWd > widgetId)
    {
        switch(context->ptrWdConfig[widgetId].senseMethod)
        {
            case (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSD_E:
                calibrateStatus = Cy_CapSense_CSDCalibrateWidget(widgetId, (uint32_t)context->ptrCommonConfig->csdRawTarget, context);
                break;

            case (uint8_t)CY_CAPSENSE_SENSE_METHOD_CSX_E:
                calibrateStatus = Cy_CapSense_CSXCalibrateWidget(widgetId, (uint32_t)context->ptrCommonConfig->csxRawTarget, context);
                break;

            default:
                break;
        }
    }

    return calibrateStatus;
}


/*******************************************************************************
* Function Name: Cy_CapSense_CalibrateAllWidgets
****************************************************************************//**
*
* Calibrates the IDACs for all the widgets in the middleware to the default
* target.
*
* This function detects the sensing method used by the widgets
* prior to calibration.
* This function is available when the CSD and/or CSX Enable IDAC
* auto-calibration parameter is enabled.
*
* \param context
* The pointer to the CapSense context structure \ref cy_stc_capsense_context_t.
*
* \return
* Returns the status of the calibration process:
* - CY_RET_SUCCESS - The operation is successfully completed.
* - CY_RET_BAD_DATA - The calibration failed and the middleware may not
* operate as expected.
*
*******************************************************************************/
cy_status Cy_CapSense_CalibrateAllWidgets(cy_stc_capsense_context_t * context)
{
    cy_status calibrateStatus = CY_RET_SUCCESS;
    uint32_t wdgtIndex;

    for (wdgtIndex = 0u; wdgtIndex < context->ptrCommonConfig->numWd; wdgtIndex++)
    {
        calibrateStatus |= Cy_CapSense_CalibrateWidget(wdgtIndex, context);
    }

