dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/cy_capsense_sensing.c
/*******************************************************************************
* Function Name: Cy_CapSense_GetVrefAutoMv
****************************************************************************//**
*
* Finds the optimal Vref value based on the VDDA voltage.
*
* \param vddaMv
* Device VDDA voltage.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetVrefAutoMv(uint32_t vddaMv)
{
    uint32_t vrefHighVoltageMv;

    if(vddaMv >= 2750u)
    {
        /*
        * The recommended VrefHigh Voltage for the VDDA >= 2.75V.
        */
        vrefHighVoltageMv = 2133u;
    }
    else if(vddaMv >= 2200u)
    {
        /*
        * The recommended VrefHigh Voltage for the 2.2V - 2.75V VDDA range.
        */
        vrefHighVoltageMv = 1600u;
    }
    else if(vddaMv >= 1800u)
    {
        /*
        * The recommended VrefHigh Voltage for the 1.8V - 2.20V VDDA range.
        */
        vrefHighVoltageMv = 1164u;
    }
    else
    {
        /*
        * The recommended VrefHigh Voltage for the VDDA < 1.80V.
        */
        vrefHighVoltageMv = 800u;
    }
    
    return(vrefHighVoltageMv);
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetVrefHighGain
****************************************************************************//**
*
* Calculates the VrefHigh Gain, based on the values of the device VDDA voltage,
* the Vref source voltage, and the desired VrefHigh voltage. 
*
* \param vddaMv
* Device VDDA voltage.
*
* \param vrefInputMv
* Vref source voltage.
*
* \param vrefDesiredMv
* Desired VrefHigh voltage.
*
* \return 
* Returns the lowest Gain code required to produce the VrefHigh voltage,
* when the VrefHigh is close to the desired voltage (passed through the
* vrefDesiredMv parameter) but not greater than the desired voltage.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetVrefHighGain(uint32_t vddaMv, uint32_t vrefInputMv, uint32_t vrefDesiredMv)
{
    uint32_t vferhiGain;

    if(vrefDesiredMv > (vddaMv - CY_CAPSENSE_VREF_VDDA_MIN_DIFF))
    {
        vrefDesiredMv = (vddaMv - CY_CAPSENSE_VREF_VDDA_MIN_DIFF);
    }

    vferhiGain = ((CY_CAPSENSE_VREF_GAIN_MAX * vrefInputMv) - 1u) / (vrefDesiredMv + 1u);

    if (vferhiGain > (uint32_t)(CY_CAPSENSE_VREF_GAIN_MAX - 1u))
    {
        vferhiGain = (uint32_t)CY_CAPSENSE_VREF_GAIN_MAX - 1u;
    }

    return (vferhiGain);
}


/*******************************************************************************
* Function Name: Cy_CapSense_GetVrefhiAutoMv
****************************************************************************//**
*
* Calculates the VrefHigh voltage, based on the Gain code and the Vref source
* voltage.
*
* \param vrefInputMv
* Vref source voltage.
*
* \param vrefGain
* The Gain code.
*
* \return 
* Returns the VrefHigh voltage in mV, to be produced for the specified vref Gain
* code and Vref source voltage.
*
*******************************************************************************/
uint32_t Cy_CapSense_GetVrefHighMv(uint32_t vrefInputMv, uint32_t vrefGain)
{
    uint32_t vrefHighMv;

    vrefHighMv =  (CY_CAPSENSE_VREF_GAIN_MAX * vrefInputMv) + ((vrefGain + 1u) >> 1u);
    vrefHighMv /= (vrefGain + 1u);

    return (vrefHighMv);
}

/* [] END OF FILE */
